-- MySQL dump 10.13  Distrib 8.0.24, for Win64 (x86_64)
--
-- Host: localhost    Database: webtoon
-- ------------------------------------------------------
-- Server version	8.0.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `writer`
--

DROP TABLE IF EXISTS `writer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `writer` (
  `alias` char(20) NOT NULL,
  `name` char(15) DEFAULT '익명',
  `gender` char(10) NOT NULL,
  `birth_date` date NOT NULL,
  PRIMARY KEY (`alias`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `writer`
--

LOCK TABLES `writer` WRITE;
/*!40000 ALTER TABLE `writer` DISABLE KEYS */;
INSERT INTO `writer` VALUES ('232','익명','여','1992-04-18'),('2사장','익명','남','1989-04-06'),('ARI','익명','여','1984-07-18'),('B급달궁','채정택','남','1972-04-22'),('d몬','익명','남','1977-05-04'),('HO9','익명','남','1989-07-27'),('Hun','최종훈','남','1980-08-16'),('JINHA','익명','여','1979-04-04'),('POGO','익명','남','1999-02-04'),('YooN','익명','여','1988-01-24'),('가천가','진형석','남','1997-04-18'),('감람','익명','남','1988-08-11'),('강은영','강은영','여','1988-05-01'),('고경빈','고경빈','남','1985-04-21'),('고일원','고일권','남','1985-01-28'),('고잉','익명','여','1991-09-10'),('공현곤','공현곤','남','1988-04-16'),('구르','한구현','남','1988-03-18'),('기송','박기송','남','1982-03-07'),('기안84','김희민','남','1985-08-11'),('김다찌','익명','여','1989-02-15'),('김선권','김선권','나','1993-06-17'),('김인호','김인호','남','1996-07-09'),('김재한','김재한','남','1990-09-15'),('김칸비','김민태','남','1987-07-12'),('김택기','김택기','남','1988-02-14'),('까를로스','익명','남','1980-05-27'),('꼬모소이','소이연','여','1984-01-25'),('꿀찬','익명','남','1988-01-21'),('나','익명','여','1988-01-11'),('남수','남수','남','1994-01-16'),('넴가','익명','남','1992-06-07'),('노란구미','정상미','여','1982-01-12'),('님니','익명','여','1988-06-09'),('다니','익명','여','1998-06-18'),('다홍','익명','여','1995-12-28'),('달삐','익명','여','1989-01-22'),('돌연변이','진창언','남','1985-12-19'),('두부','익명','여','1995-04-12'),('럭스','익명','남','1987-11-28'),('령','익명','여','1998-06-07'),('루시드','익명','남','1990-08-12'),('마인드C','강민구','남','1996-11-15'),('면지','익명','여','1987-02-11'),('모랑지','익명','여','1987-05-17'),('모죠','강보라','여','1987-03-16'),('문지현','문지현','여','1979-03-25'),('민송아','민송연','여','1999-09-18'),('민홍','익명','남','1978-06-02'),('박새','익명','여','1987-05-04'),('박은혁','박은혁','남','1994-12-16'),('박혬','익명','남','1991-09-11'),('배세혁','배세혁','남','1984-09-16'),('백승훈','배승훈','남','1984-05-30'),('브라보 장','익명','여','1984-01-19'),('빤스','손박석','남','1981-05-30'),('산삼','익명','남','1991-11-19'),('산차','이산','여','1988-04-11'),('삼촌','이지은','여','1987-04-21'),('상하','한상하','여','1998-11-11'),('샤니','김시환','남','1995-12-30'),('서승준','서승준','남','1989-09-07'),('서이','박서이','여','1989-02-15'),('선지','익명','여','1994-02-25'),('설이','익명','여','1988-07-05'),('성코','익명','남','1984-02-11'),('세정','이세정','여','1990-08-10'),('소나음','하연','여','1995-12-11'),('소이','송소이','여','1982-01-11'),('소장','익명','남','1984-07-07'),('손하기','손하기','여','1995-04-28'),('수오수','익명','여','1989-11-25'),('수진','이수진','여','1991-07-03'),('슈안','익명','여','1990-03-21'),('슬랭킷','박한민','남','1989-11-20'),('시우','이종휘','남','1995-02-21'),('신여름','신여름','여','1994-11-28'),('실','익명','여','1986-06-18'),('심웅섭','심웅섭','남','1989-02-24'),('아이아리','김지연','여','1989-05-02'),('안수민','안수민','여','1989-05-06'),('알파A','김재현','남','1992-05-28'),('야옹이','김나영','여','1991-06-25'),('양세준','양세준','남','1984-04-11'),('에리카','익명','여','1981-04-22'),('연제원','연제원','남','1990-02-24'),('영파카','익명','남','1994-07-14'),('오리','익명','여','1999-03-25'),('오묘','익명','여','1986-07-15'),('오세형','오세형','남','1987-01-01'),('옹구','박옹구','남','1994-08-28'),('원주민','원주민','남','1986-04-16'),('원해','이원해','남','1991-07-15'),('유누','익명','여','1984-08-13'),('유상진','유상진','남','1978-01-17'),('유성연','유성연','남','1988-01-17'),('유은','유은비','여','1982-10-25'),('유지별이','유별이','여','1980-02-22'),('윤성원','윤성원','남','1987-09-01'),('윤정민','윤정민','남','1992-08-05'),('은꼼지','지은고','여','1997-09-12'),('이건','이건','남','1985-04-01'),('이리','익명','여','1989-09-17'),('이명재','이명재','남','1981-02-07'),('이무기','이재철','남','1984-08-09'),('이언','이언','남','1988-09-05'),('이에프','익명','남','1991-10-19'),('이원식','이원식','남','1989-01-23'),('이은재','이은재','남','1988-05-05'),('이작가','이수현','여','1982-06-24'),('이재익','이재익','남','1974-06-12'),('이학','이학','남','1989-05-22'),('이행복','이행복','여','1995-08-11'),('임리나','임리나','여','1986-04-11'),('임주이','임주이','여','1994-04-18'),('장래혁','장래혁','남','1996-05-08'),('장성준','장성준','남','1984-10-11'),('장이','익명','남','1977-06-22'),('정찬','정찬','남','1995-07-08'),('조용석','조용석','남','1984-05-05'),('주동근','주동근','남','1983-08-23'),('준','익명','남','1991-02-04'),('즐바센','익명','남','1977-10-15'),('지에이','지안민','남','1990-09-25'),('채나라','채나라','여','1983-02-22'),('콩자','익명','여','1986-04-13'),('하랑','이하랑','남','1995-06-24'),('하마','익명','남','1982-04-23'),('하찌','하지연','여','1983-01-13'),('하하영','익명','여','1985-12-09'),('한짜장','한지연','여','1989-02-28'),('해무리','익명','여','1993-04-08'),('해오','익명','남','1979-05-02'),('햇님','익명','남','1988-01-24'),('허니비','이지연','여','1991-04-12'),('홍달','익명','여','1982-07-15'),('홍작가','홍성혁','남','1999-04-12'),('홍필','홍필','남','1986-09-15'),('환댕','익명','남','1989-06-23'),('효기','김효민','남','1995-04-22');
/*!40000 ALTER TABLE `writer` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-31 17:03:46
