-- MySQL dump 10.13  Distrib 8.0.24, for Win64 (x86_64)
--
-- Host: localhost    Database: webtoon
-- ------------------------------------------------------
-- Server version	8.0.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `serialization`
--

DROP TABLE IF EXISTS `serialization`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `serialization` (
  `webtoon_name` varchar(20) NOT NULL,
  `state` char(10) NOT NULL,
  `day_of_the_week` char(10) NOT NULL,
  PRIMARY KEY (`webtoon_name`),
  CONSTRAINT `serialization_ibfk_1` FOREIGN KEY (`webtoon_name`) REFERENCES `webtoon` (`webtoon_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `serialization`
--

LOCK TABLES `serialization` WRITE;
/*!40000 ALTER TABLE `serialization` DISABLE KEYS */;
INSERT INTO `serialization` VALUES ('3cm 헌터','휴재','수요일'),('ENT.','연재','월요일'),('가비지타임','완결','목요일'),('각자의 디데이','연재','화요일'),('간 떨어지는 동거','연재','수요일'),('격기3반','연재','수요일'),('결혼생활 그림일기','연재','목요일'),('고쌈무쌍','휴재','수요일'),('군주','휴재','수요일'),('귀각시','연재','목요일'),('귀곡의 문','휴재','수요일'),('그날 죽은 나는','연재','수요일'),('그녀석 정복기','연재','금요일'),('그들에게 사면초가','휴재','목요일'),('그린보이','연재','목요일'),('급식러너','연재','목요일'),('기기괴괴','연재','목요일'),('기억흔적','휴재','금요일'),('꼬리','완결','토요일'),('꿈의 기업','연재','일요일'),('나노리스트','휴재','일요일'),('나의 플랏메이트','휴재','일요일'),('내 룸메이트는 마네킹','연재','토요일'),('노선도','연재','월요일'),('달수 이야기','휴재','월요일'),('더 복서','연재','수요일'),('더 트웰브','연재','화요일'),('데이빗','연재','수요일'),('도를 아십니까','휴재','수요일'),('동생친구','완결','월요일'),('똑똑한 나 인증','휴재','화요일'),('라서드','완결','금요일'),('라스트 서브미션','연재','금요일'),('랜덤채팅의 그녀','연재','일요일'),('럭키언럭키','완결','토요일'),('레사','연재','일요일'),('리턴','연재','금요일'),('마지막 지수','휴재','토요일'),('만찢남녀','완결','수요일'),('모두 너였다','완결','목요일'),('모락모락 왕세자님','완결','월요일'),('모죠의 일지','휴재','금요일'),('몬스터','완결','월요일'),('미스터 모','완결','화요일'),('바른연애 길잡이','완결','토요일'),('바이러스X','완결','목요일'),('반귀','휴재','화요일'),('백호랑','연재','수요일'),('뱀은 꽃을 먹는가','휴재','목요일'),('별을 삼킨 너에게','휴재','금요일'),('별종','연재','금요일'),('보살님이 캐리해','연재','수요일'),('복학생 정순이','완결','금요일'),('복학왕','휴재','일요일'),('부활남','연재','수요일'),('뷰티풀 군바리','연재','일요일'),('블러드레인','연재','수요일'),('빅맨','연재','수요일'),('빛빛빛','연재','월요일'),('사냥개들','연재','목요일'),('사랑의 헌옷수거함','휴재','일요일'),('사막에 핀 달','완결','일요일'),('살人스타그램','연재','토요일'),('삼국지톡','완결','목요일'),('삼매경','휴재','수요일'),('상연','연재','화요일'),('새벽 두 시의 신데렐라','휴재','월요일'),('서북의 저승사자','연재','금요일'),('선배, 그 립스틱 바르지 마요','연재','화요일'),('셈하는 사이','연재','수요일'),('셧업앤댄스','휴재','목요일'),('소녀더와일즈','연재','목요일'),('소녀의 세계','휴재','일요일'),('손의 흔적','연재','화요일'),('수사9단','연재','일요일'),('수영만화일기','연재','일요일'),('순정말고 순종','연재','목요일'),('숲속의 담','연재','수요일'),('스윗솔티','연재','금요일'),('스테어스','연재','금요일'),('신도림','연재','수요일'),('신의한수','완결','월요일'),('심장이뛰다','완결','일요일'),('싸이코 리벤지','완결','토요일'),('안녕, 대학생','연재','토요일'),('안식의 밤','휴재','월요일'),('얼굴천재','연재','화요일'),('여신강림','휴재','일요일'),('연놈','휴재','목요일'),('연애혁명','연재','수요일'),('엽총소년','연재','수요일'),('오늘도 사랑하세요','휴재','월요일'),('오늘의 순정망화','완결','일요일'),('오로지 오로라','연재','수요일'),('올가미','완결','금요일'),('왕따협상','완결','화요일'),('요리GO','연재','월요일'),('우연일까?','휴재','화요일'),('우월한하루','연재','수요일'),('원주민 공포만화','연재','목요일'),('원티드','휴재','목요일'),('웰컴 온보드','완결','목요일'),('위아더 능력자','완결','수요일'),('위아더좀비','연재','일요일'),('윈드브레이커','연재','화요일'),('유일무이 로맨스','완결','금요일'),('은주의 방','연재','목요일'),('이두나!','완결','토요일'),('이런 영웅은 싫어','연재','목요일'),('이제 곧 죽습니다','휴재','금요일'),('이츠마인','연재','금요일'),('인간의 온도','연재','토요일'),('자판귀','완결','일요일'),('잔불의 기사','연재','월요일'),('장단에 맞춰줘','휴재','수요일'),('저승사자 출입금지','연재','월요일'),('정년이','휴재','일요일'),('정보전사 202','연재','일요일'),('제로게임','완결','금요일'),('중독연구소','휴재','토요일'),('지금 우리 학교는','휴재','화요일'),('찐:종합게임동아리','연재','수요일'),('착한건 돈이된다','연재','화요일'),('창위의일루젼','연재','토요일'),('첫사랑입니다만','연재','화요일'),('칼가는 소녀','연재','월요일'),('칼부림','연재','화요일'),('커피도둑','휴재','일요일'),('태권보이','휴재','토요일'),('태시트','연재','화요일'),('투명살인','연재','수요일'),('트리거','연재','월요일'),('판타지 여동생','연재','수요일'),('패션왕','연재','월요일'),('평범한 8반','연재','화요일'),('풋내기들','연재','금요일'),('프린스 메이커','연재','수요일'),('플레이, 플리','연재','월요일'),('플로우','연재','수요일'),('피로만땅','완결','금요일'),('피에는 피','완결','수요일'),('피플','연재','목요일'),('필살VS로맨스','완결','토요일'),('하르모니아','연재','목요일'),('하슬라','연재','금요일'),('해귀','연재','수요일'),('현혹','연재','금요일'),('호랑이 들어와요','연재','금요일'),('호수의 인어','완결','금요일'),('홍차리브레','연재','금요일'),('후레자식','연재','수요일'),('후유증','연재','수요일'),('히어로메이커','연재','월요일');
/*!40000 ALTER TABLE `serialization` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-31 17:03:47
